Revit 2027 API
DividedSurface.RemoveAllIntersectionElements Method
 Removes all the intersection elements from a divided surface.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void RemoveAllIntersectionElements()
Public Sub RemoveAllIntersectionElements
public:
void RemoveAllIntersectionElements()
member RemoveAllIntersectionElements : unit -> unit
See Also
Reference
DividedSurface Class
Autodesk.Revit.DB Namespace